#include <STC12C5A.H>
#include <DS18B20.h>

sbit DQ = P3^4;			//定义DQ引脚为P3.4
//**************************************************************************************************
//精确延时函数(使用12M晶振，延时T=2*t+5个指令周期,t为char型,改为int型,会加大误差）
//**************************************************************************************************
void DS18B20_Delay(unsigned int t)
{
 while(--t);
}
//**************************************************************************************************
//传感器初始化
//**************************************************************************************************
void Init_DS18B20(void)
{
    uchar flag;
    DQ=1;
    DS18B20_Delay(80);  //延时
    DQ=0;
    DS18B20_Delay(800); //*延时，要求精度，要求大于480us*
    DQ=1;
    DS18B20_Delay(140); //*延时，要求精度，要求大于15us*
    flag=DQ;    //DQ管脚送出60-240us的0脉冲,以示初始化成功
    DS18B20_Delay(200);  //延时
}
//**************************************************************************************************
//写一个字节函数
//**************************************************************************************************
void write_byte(uchar t)
{
 uchar i;
 for(i=0;i<8;i++)   //循环8次写入1字节
  {
    DQ=0;           //数据线置低
    DS18B20_Delay(10);      //延时
    DQ=t&0x01;      //发送1位数据,最低位开始
    DS18B20_Delay(50);      //*延时，要求精度*
    DQ=1;           //数据线置高
    t=t>>1;         //右移1位
  }
}
//**************************************************************************************************
//读一个字节函数
//**************************************************************************************************
uchar read_byte()
{
 uchar i,value=0;;
 for(i=0;i<8;i++)   //循环8次读取1字节
  {
    value=value>>1; //右移1位
    DQ=0;           //数据线置低
    DS18B20_Delay(10);      //延时
    DQ=1;           //数据线置高
    DS18B20_Delay(10);      //延时
    if(DQ==1)value=value|0x80;//判断接收的1位数据是否为1
    DS18B20_Delay(40);      //*延时，要求精度*
  }
 return(value);
}
//**************************************************************************************************
//数据处理子函数
//**************************************************************************************************
//void chuli(uint temperature,uchar *Data)
//{
// float t;
//
// t=temperature*0.0625+0.05;     //计算出温度值，百分位四舍五入
//
// temperature=t*10;              //本实验显示到小数点后1位,所以乘10，以便分离得到十分位
//
// Data[0]=temperature/100+0x30;   //除100取整得温度十位
// Data[1]=temperature%100/10+0x30;//除100取余得十位和个位，然后除10取整得温度个位
// Data[2]=temperature%10+0x30;    //除10取余得温度十分位，1602只识别ASCII码，+0x30目的就是把16进制转ASCII
//}
//**************************************************************************************************
//温度采集函数
//**************************************************************************************************
uint get_temp()
{
    uint dat;
    uchar wenl,wenh;
    Init_DS18B20();       //复位
    write_byte(0xcc);     //不进行编号匹配
    write_byte(0x44);     //进行温度转换
    Init_DS18B20();       //复位  
    write_byte(0xcc);     //不进行编号匹配
    write_byte(0xbe);     //发读命令
    wenl=read_byte();     //温度低八位
    wenh=read_byte();     //温度高八位
    dat=(wenh<<8)+wenl;   //数据高低8位合并
    return(dat);          //返回测量结果
}